# Используем легковесный образ Python 3.11
FROM python:3.11-slim

# --- БЛОК БЕЗОПАСНОСТИ ---
# Обновляем системные пакеты внутри образа, чтобы закрыть известные уязвимости.
# <--- ИСПРАВЛЕНИЕ УЯЗВИМОСТЕЙ
RUN apt-get update && apt-get upgrade -y && rm -rf /var/lib/apt/lists/*

# Устанавливаем переменную окружения для небуферизованного вывода
# <--- СТИЛИСТИЧЕСКОЕ ИСПРАВЛЕНИЕ
ENV PYTHONUNBUFFERED=1

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями и устанавливаем их
COPY requirements.txt ./
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта
COPY . .

# Устанавливаем команду, которая будет запускаться при старте контейнера
CMD ["python", "main.py"]